# Brewfile — macOS (and Linuxbrew) packages.
# Install with:  brew bundle --file=~/dotfiles/packages/Brewfile

# Core CLI
brew "git"
brew "stow"
brew "zsh"
brew "neovim"
brew "tmux"
brew "starship"

# Shell plugins (sourced by .zshrc when present)
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Language version managers (initialized by devtools.zsh when present)
brew "pyenv"
brew "nvm"

# Modern replacements (referenced by the zsh aliases)
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "jq"

# Nice to have
brew "gh"
brew "htop"
brew "tree"
brew "wget"

# macOS-only casks (this Brewfile is only run on macOS by bootstrap.sh)
cask "font-jetbrains-mono-nerd-font"  # starship.toml uses Nerd Font glyphs
# cask "ghostty"
# cask "rectangle"
